Revit 2024 API
ImageType.Source Property
 The source of the image in the ImageType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public ImageTypeSource Source { get; }
Visual Basic
Public ReadOnly Property Source As ImageTypeSource
	Get
Visual C++
public:
property ImageTypeSource Source {
	ImageTypeSource get ();
}
See Also
ImageType Class
Autodesk.Revit.DB Namespace